backend/controllers/AcuerdosController.php

    public function actionNuevoAcuerdo($id)
    {
        $model = new Acuerdos();
        $model->minutas_id = $id;

        $secretariasdata = array();

        $responsables = \backend\models\Responsables::find()->where(['seguimientos_id' => $model->minutas->seguimientos_id])->all();
        foreach ($responsables as $responsables){
           $secretariasdata[] = $responsables->secretarias_id;
        }
        $participantes = \backend\models\Participantes::find()->where(['seguimientos_id' => $model->minutas->seguimientos_id])->all();
        foreach ($participantes as $participante){
           $secretariasdata[] = $participante->secretarias_id;
        }


        $secretarias = \yii\helpers\ArrayHelper::map(\backend\models\Secretarias::find()->where(['id' => $secretariasdata])->all(), 'id', 'nombre');




        if ($model->load(Yii::$app->request->post()) ) {
---
SELECT * FROM `responsables` WHERE `seguimientos_id`=1
SELECT * FROM `participantes` WHERE `seguimientos_id`=1
SELECT * FROM `secretarias` WHERE `id` IN (1, 9)
SELECT * FROM `minutas` WHERE `id`='2'