backend/controllers/AvancesController.php

SELECT * FROM `acuerdos` WHERE `minutas_id`='1'
---
    public function actionNuevoAvance($id)
    {
        $model = new Avances();
        $model->scenario = Avances::SCENARIO_NUEVO_ACANCE;
        $modelimg = new \backend\models\ImgAvances();

        $acuerdos = \yii\helpers\ArrayHelper::map(\backend\models\Acuerdos::find()->where(['minutas_id' => $id])->all(), 'id', 'acuerdo');