backend/controllers/MinutasController.php

    protected function findModel($id)
    {
        if (($model = Minutas::findOne($id)) !== null) {
---
SELECT * FROM `minutas` WHERE `id`='2'