backend/controllers/SeguimientosController.php

    protected function findModel($id)
    {
        if (($model = Seguimientos::findOne($id)) !== null) {
---
SELECT * FROM `seguimiento` WHERE `id`='1'

    public function actionGenerarMinuta($id) {
        $minutas = new \backend\models\Minutas();
        $minutas->seguimientos_id = $id;

        $secretarias_responsables = \yii\helpers\ArrayHelper::map(\backend\models\Secretarias::find()->all(), 'id', 'nombre');
        $secretarias_participantes = \yii\helpers\ArrayHelper::map(\backend\models\Secretarias::find()->all(), 'id', 'nombre');
        $proyectos_estrategicos = \yii\helpers\ArrayHelper::map(\backend\models\ProyectosEstrategicos::find()->all(), 'id', 'nombre');
        $tareas = \yii\helpers\ArrayHelper::map(Seguimientos::find()->all(), 'id', 'tema');



        $minutas->fecha = date('Y-m-d');
        $minutas->tema = $minutas->seguimientos->tema;

        if ($minutas->load(Yii::$app->request->post())) {
---
SELECT * FROM `seguimiento`