backend/controllers/SeguimientosController.php

     public function actionView($id) { // id de minuta para jalar avances

           $model = $this->findModel($id);

           $minutas = \backend\models\Minutas::findOne(['seguimientos_id' => $id])->id; //

           //$acuerdos = \backend\models\Acuerdos::findOne(['minutas_id' => $minutas])->id; //

           //$avances = \backend\models\Avances::find()->where(['acuerdos_id' => $acuerdos])->all();

           $responsables = \backend\models\Responsables::find()->where(['seguimientos_id' => $id])->all();
           $participantes = \backend\models\Participantes::find()->where(['seguimientos_id' => $id])->all();

           $minutas_registradas = \backend\models\Minutas::find()->where(['seguimientos_id' => $model->id])->all();
           $avances_registrados = \backend\models\Avances::find()->where(['minuta_id' => $id])->all();

        return $this->render('view', [
                    'model' => $this->findModel($id),
                    //'avances_secretaria' => $avances,
                    'responsables' => $responsables,
                    'participantes' => $participantes,
                    'minutas' => $minutas,
            //'acuerdos'=>$acuerdos,
            'avances_registrados' =>  $avances_registrados,
            'minutas_registradas' => $minutas_registradas,
        ]);
---
SELECT * FROM `minutas` WHERE `seguimientos_id`='1'
SELECT * FROM `responsables` WHERE `seguimientos_id`='1'
SELECT * FROM `participantes` WHERE `seguimientos_id`='1'
SELECT * FROM `minutas` WHERE `seguimientos_id`=1
SELECT * FROM `avances` WHERE `minuta_id`='1'
SELECT * FROM `acuerdos` WHERE `minutas_id`=1
SELECT * FROM `minutas` WHERE `seguimientos_id`=3

    public function actionMinutas($id) { // id de seguimiento

           $model = $this->findModel($id);

           $minutas = 0;//;\backend\models\Minutas::findOne(['seguimientos_id' => $id])->id; // 1

           $acuerdos = 0;//\backend\models\Acuerdos::findOne(['minutas_id' => $minutas])->id; // 2 acuerdos, 1,2

           $avances = 0;//\backend\models\Avances::find()->where(['acuerdos_id' => $acuerdos])->all();

           $responsables = \backend\models\Responsables::find()->where(['seguimientos_id' => $id])->all();
           $participantes = \backend\models\Participantes::find()->where(['seguimientos_id' => $id])->all();

           $minutas_registradas = \backend\models\Minutas::find()->where(['seguimientos_id' => $id])->all();
           $avances_registrados = \backend\models\Avances::find()->where(['minuta_id' => $id])->all();


        return $this->render('minutas', [
                    'model' => $this->findModel($id),
                    'avances_secretaria' => $avances,
                    'responsables' => $responsables,
                    'participantes' => $participantes,
                    'minutas' => $minutas,
                    //'acuerdos'=>$acuerdos,
            'minutas_registradas' => $minutas_registradas,
            'avances_registrados' =>  $avances_registrados,
        ]);
---
SELECT * FROM `minutas` WHERE `seguimientos_id`='1'
SELECT * FROM `acuerdos` WHERE `minutas_id`=1
SELECT * FROM `avances` WHERE `acuerdos_id`=1
SELECT * FROM `responsables` WHERE `seguimientos_id`='1'
SELECT * FROM `participantes` WHERE `seguimientos_id`='1'
SELECT * FROM `avances` WHERE `minuta_id`='1'
SELECT * FROM `minutas` WHERE `seguimientos_id`='3'
SELECT * FROM `avances` WHERE `minuta_id`='3'

    protected function findModel($id)
    {
        if (($model = Seguimientos::findOne($id)) !== null) {
---
SELECT * FROM `seguimiento` WHERE `id`='1'

    public function actionResponsables($dependencia = '', $q = null) {
        \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        //$out = ['results' => ['id' => '', 'text' => '']];
        $query = \backend\models\Secretarias::find()->select(['id', 'text' => 'nombre']);
        if ($dependencia != '') {
            $recibido = explode(',', $dependencia);
            $query->where(['not in', 'id', $recibido]);
        }
        if ($q != null) {
            $query->where(['like', 'nombre', $q]);
        }
        if ($q != null and $dependencia != '') {
            $query->where(['not in', 'id', $recibido]);
            $query->andWhere(['like', 'nombre', $q]);
        }


        $out['results'] = $query->asArray()->all();
---
SELECT * FROM `secretarias`