backend/controllers/SeguimientosController.php

     public function actionView($id) { // id de minuta para jalar avances

           //$model = $this->findModel($id); // Model del seguimiento

           $minutas = \backend\models\Minutas::findOne(['id' => $id]); // btn avances --  minuta

           $model = \backend\models\Seguimientos::findOne(['id' => $minutas->seguimientos_id]);  // Model del seguimiento
---
SELECT * FROM `seguimiento` WHERE `id`=3