backend/views/minutas/vista.php

                    </tr>
                     <tr style="background:none">
                        <td class="label" style="border:1.5px solid white;"><b><?php echo 'Proyecto Bandera'; ?></b></td>
                                    <td><?php $proyectosb = \backend\models\MProyectos::find()->where(['minutas_id' => $model->id])->all();
---
SELECT * FROM `m_proyectos` WHERE `minutas_id`=2

  </thead>
  <tbody>
   <?php
   $acuerdos = \backend\models\Acuerdos::find()->where(['minutas_id' => $model->id])->all();
---
SELECT * FROM `acuerdos` WHERE `minutas_id`=2