backend/views/seguimientos/index.php

                [
                    'attribute' => 'secretaria_responsable',
                    'visible' => Yii::$app->user->can('admin-filtro-responsable') ? true : false,
                    'filter' => Html::activeDropDownList($searchModel, 'secretaria_responsable', \yii\helpers\ArrayHelper::map(\backend\models\Secretarias::find()->asArray()->all(), 'id', 'nombre'), ['class' => 'form-control', 'prompt' => 'Seleccionar Secretaria']),
---
SELECT * FROM `responsables` WHERE `seguimientos_id`=1
SELECT * FROM `secretarias`

                [
                    'attribute' => 'secretaria_participante',
                    'visible' => Yii::$app->user->can('admin-filtro-participante') ? true : false,
                    'filter' => Html::activeDropDownList($searchModel, 'secretaria_participante', \yii\helpers\ArrayHelper::map(\backend\models\Secretarias::find()->asArray()->all(), 'id', 'nombre'), ['class' => 'form-control', 'prompt' => 'Seleccionar Secretaria']),
---
SELECT * FROM `participantes` WHERE `seguimientos_id`=1
SELECT * FROM `secretarias`