backend/views/seguimientos/view.php



  //Termina Otros
                        $imgs = backend\models\ImgAvances::findOne(['avances_id' => $avances->id])->archivo;
---
SELECT * FROM `img_avances` WHERE `avances_id`=4