backend/views/seguimientos/view.php

SELECT * FROM `img_avances` WHERE `avances_id`=2
---


  //Termina Otros
                        $imgs = backend\models\ImgAvances::findOne(['avances_id' => $avances->id])->archivo;