backend/views/seguimientos/minuta/nueva.php

SELECT * FROM `responsables` WHERE `seguimientos_id`='2'
---
                                </tr>
                            </thead>
                            <?php
                                $responsables = backend\models\Responsables::find()->where(['seguimientos_id' => $minutas->seguimientos_id])->all();

SELECT * FROM `participantes` WHERE `seguimientos_id`='2'
---
                                </tr>
                            </thead>
                            <?php
                                $participantes = backend\models\Participantes::find()->where(['seguimientos_id' => $minutas->seguimientos_id])->all();